Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/redundancy_payments.html.txt.tmx
Source language: en
Languages: ga

source: Where you lose your job due to circumstances such as the closure of the business or a reduction in the number of staff this is known as redundancy
ga: Nuair a chailltear post de bharr cúinsí mar dúnadh gnó nó laghdú a theacht ar líon na foirne cuirtear síos ar seo mar iomarcaíocht

source: The Redundancy Payments Acts 1967–2014 provide a minimum entitlement to a redundancy payment for employees who have a set period of service with the employer
ga: Tugann na hAchtanna um Íocaíochtaí Iomarcaíochta 1967–2014 le fios go bhfuil fostaithe a bhfuil tréimhse socraithe seirbhíse caite acu i dteideal íocaíocht iomarcaíochta

source: Not all employees are entitled to the statutory redundancy payment, even where a redundancy situation exists
ga: Ní bhíonn gach fostaí i dteideal na híocaíochta iomarcaíochta reachtúla, fiú nuair a bhíonn cás iomarcaíochta i gceist

source: If you do qualify for redundancy there are specific redundancy procedures which employers and employees must follow in order to comply with the legislation
ga: Má tá tú incháilithe le haghaidh iomarcaíochta tá nósanna iomarcaíochta ann a gcaithfidh fostóirí agus fostaithe cloí leo chun a bheith ar aon dul leis an reachtaíocht

source: However, you and your employer may agree a redundancy payment above the statutory minimum, and in such circumstances, employees who have not reached the statutory minimum period of service may also receive a payment
ga: Is féidir leatsa teacht ar chomhaontú áfach le do fhostóir maidir le híocaíocht iomarcaíochta sa bhreis ar an íosmhéid reachtúil, sa chás seo is féidir le fostaithe eile nach bhfuil an íostréimhse seirbhíse caite acu íocaíocht a ghabháil chomh maith

source: For example, statutory redundancy only applies to employees with two years' service
ga: Mar shampla, ní thagann iomarcaíocht reachtúil i bhfeidhm ach amháin i gcás fostaí a bhfuil seirbhís dhá bhliana déanta aige/aici

source: However, an employer might agree to pay a lump sum to employees with less than two years' service
ga: D'fhéadfadh áfach, go dtabharfadh fostóir cnapshuim do fhostaithe nach bhfuil seirbhís dhá bhliana déanta acu

source: This payment arises through agreement and not through a statutory entitlement
ga: Tiocfaidh an íocaíocht seo i gceist de bharr comhaontaithe seachas de bharr na reachtaíochta

source: As so often in employment law, the legislation is concerned with ensuring minimum rights, while allowing the parties to agree more substantial rights
ga: Mar is gnách le dlí fostaíochta, ní dhéanann an reachtaíocht ach na híoschearta a chur i bhfeidhm, tig leis na páirtithe féin teacht ar chomhaontú maidir le cearta níos substaintiúla

source: Employer rebate abolition: There will be no statutory redundancy employer rebate where the date of dismissal due to redundancy is on or after 1 January 2013
ga: Cealú lacáiste an fhostóra: Ní íocfar aon lacáiste fostóra le haghaidh iomarcaíochta reachtúil i gcás go mbristear duine as post ar chúis iomarcaíochta ar an 1 Eanáir 2013 nó dá éis

source: The statutory redundancy payment is a lump-sum payment based on the pay of the employee
ga: Íocaíocht chnapshuime bunaithe ar phá an fostaí is ea an íocaíocht reachtúil iomarcaíochta

source: All eligible employees are entitled to:
ga: Tá gach fostaí incháilithe i dteideal

source: • Two weeks' pay for every year of service over the age of 16 and
ga: • Pá 2 sheachtaine ar son gach bliain seirbhíse os cionn 16 bliain d'aois, agus

source: The amount of statutory redundancy is subject to a maximum earnings limit of €600 per week (€31,200 per year)
ga: Tá an íocaíocht chnapshuime bunaithe faoi réir uasteorainn phá €600 sa tseachtain (€31,200 sa bhliain)

source: Pay refers to your current normal weekly pay including average regular overtime and benefits-in-kind, but before tax and PRSI deductions, that is your gross pay
ga: Pá ná ghnáthphá seachtaine, meánragobair rialta agus sochair comhchineáil san áireamh, roimh asbhaintí cánach agus ÁSPC, sé sin do phá comhlán

source: The statutory redundancy payment is tax-free
ga: Bíonn an íocaíocht reachtúil iomarcaíochta saor ó cháin

source: Reckonable and non-reckonable service
ga: Seirbhís inríofa agus neamhinríofa

source: All redundancies notified after 10 April 2005 take account of absences from work only over the last 3 years of service
ga: Beidh neamhláithreachtaí ó obair le linn na trí bliana deireanacha amháin san áireamh i ngach iomarcaíocht a fógraíodh i ndiaidh 10 Aibreán 2005

source: Any absences outside of this 3-year period which ends on the date of termination of employment are disregarded
ga: Ní cuirfear aon neamhláithreacht san áireamh a tharla taobh amuigh den tréimhse trí bliana suas go dtí an dáta ar briseadh an duine as a p(h)ost

source: When reckoning or calculating the actual length of your service for redundancy payment purposes, the following are regarded as reckonable service, (the absences listed here are called reckonable absences):
ga: Agus tú ag áireamh fad do sheirbhíse le haghaidh íocaíocht iomarcaíochta, cuirfear na tréimhsí seo a leanas san áireamh, (tugtar asláithreachtaí inríofa ar na hasláithreachtaí seo):

source: • The period you were actually in work
ga: • Aon tréimhse lena linn a raibh tú ag obair

source: • Any absence from work due to holidays
ga: • Aon tréimhse neamhláithreacht oibre be bharr saoire

source: • Any absence from work due to illness (see below for non-reckonable periods of illness)
ga: • Aon tréimhse neamhláithreacht oibre de bharr tinnis (féach thíos tréimhsí tinnis nach bhfuil inríofa)

source: • Any period where you were absent from work by agreement with your employer (typically career break)
ga: • Aon tréimhse a raibh tú saor ó obair agus an fostóir aontaithe leis seo (sos gairme de ghnáth)

source: • Any period of basic and additional maternity leave allowed under the legislation
ga: • Aon tréimhse bhunshaoire mháithreachais agus saoire mháithreachais bhreise atá ceadaithe ag an reachtaíocht

source: • Any period of basic adoptive/paternity/parental/carer's leave
ga: • Aon tréimhse a raibh tú ar bhunshaoire uchtála/atharthachta/tuismitheora/cúramóra

source: • Any period of lock-out from your employment
ga: • Aon tréimhse a raibh tú frithdhúnta ó do chuid oibre

source: • Any period where the continuity of your employment is preserved under the Unfair Dismissals Acts
ga: • Aon tréimhse a bhfuil leanúnachas do chuid fostaíochta caomnaithe ag Na hAchtanna um Dhífhostú Eagórach

source: However, in making the calculation of the length of your service, the following periods over the last 3 years will not be taken into account as service, (these are called non-reckonable absences):
ga: Agus ag áireamh fad do sheirbhíse, ní tabharfar san áireamh na tréimhsí seo a leanas mar sheirbhís le linn na 3 bliana deireanacha (asláithreachtaí neamhinríofa a dtugtar orthu seo):

source: • Any period over 52 consecutive weeks where you were off work due to an injury at work
ga: • Aon tréimhse thar 52 sheachtain leantach a raibh tú saor ó obair de bharr gortaithe a tharla agus tú ag obair

source: • Any period over 26 consecutive weeks where you were off work due to illness
ga: • Aon tréimhse thar 26 seachtainí leantach a raibh tú saor ó obair de bharr tinnis

source: • Any period of lay off from work
ga: • Aon tréimhse leagan as foirne

source: You can use this online redundancy calculator to help you to calculate your statutory redundancy entitlement
ga: Tig leat an táireamhán iomarcaíochta ar líne seo a úsáid chun do theidlíocht a áireamh le haghaidh iomarcaíochta reachtúla

source: You should note that the online redundancy calculator does not purport to give a legal entitlement to any statutory redundancy amount
ga: Tabhair faoi deara nach dtugann an táireamhán iomarcaíochta ar líne aon teidlíocht maidir le méid na hiomarcaíochta reachtúla

source: Reduced hours and short-time work
ga: Uaireanta laghdaithe agus obair gearr-ama

source: If you were made redundant within a year of being put on reduced hours or pay, your redundancy payment would be based on your earnings for a full week
ga: Má rinneadh tú iomarcach laistigh de bhliain amháin ón am a cuireadh ar uaireanta nó pá laghdaithe tú, bheadh d’íocaíocht iomarcaíochta bunaithe ar do thuilleamh do sheachtain iomlán

source: If you are made redundant after working reduced hours for more than a year, how your payment will be calculated depends on whether you accepted being on reduced hours or not
ga: Má dhéantar iomarcach tú tar éis duit uaireanta laghdaithe a oibriú do thréimhse níos mó ná bliain amháin, beidh an dóigh a ndéantar d’íocaíocht a ríomh ag brath ar cé acu ar ghlac tú nó nár ghlac tú le huaireanta laghdaithe

source: If you fully accepted the reduced working hours as your normal week and never asked to return to full-time work, then your redundancy payment will be based on your gross pay for the reduced working hours
ga: Más rud é gur ghlac tú go hiomlán le huaireanta oibre laghdaithe mar do sheachtain normálta agus níor iarr tú filleadh go hobair lánaimseartha, mar sin beidh d’íocaíocht bunaithe ar do phá comhlán le haghaidh na n-uaireanta laghdaithe

source: If, on the other hand, you never accepted the reduced working hours as your normal hours and continually asked to be put back on full-time working, your payment would be based on your normal weekly earnings
ga: Más rud é, ar an taobh eile de, nár ghlac tú riamh leis na huaireanta oibre laghdaithe mar chuid de d’uaireanta normálta agus gur iarr tú ar bhonn leanúnach le bheith curtha ar ais ar obair lánaimseartha, beidh d’íocaíocht bunaithe ar do thuilleamh do sheachtain iomlán

source: If you have been put on short time and then are made redundant your redundancy payment may be based on your pay for a full week
ga: D’fhéadfadh d'íocaíocht iomarcaíochta a bheith bunaithe ar phá seachtaine iomláine má cuireadh ar obair ghearr-ama thú agus má rinneadh iomarcach thú ina dhiaidh sin

source: If you have a dispute about this with your employer you could make a claim to the Workplace Relations Commission
ga: Má bhíonn conspóid agat le d’fhostóir faoi seo is féidir leat éileamh a dhéanamh leis an gCoimisiún um Chaidreamh san Áit Oibre

source: If you receive a lump sum in compensation for the loss of employment, part of it may be tax-free
ga: Má fhaigheann tú cnapshuim mar chúiteamh ar chailleadh fostaíochta, d'fhéadfadh cuid de a bheith saor ó cháin

source: The statutory redundancy lump sum is always tax-free
ga: Bíonn an chnapshuim íocaíocht iomarcaíochta reachtúil saor ó cháin i gcónaí

source: Read more about taxation of lump-sum payments on redundancy/retirement
ga: Léigh tuilleadh mar gheall ar chánachas cnapshuimeanna iomarcaíochta/scoir anseo

source: The Revenue Commissioners have published a leaflet on taxation and redundancy
ga: Breathnaigh ar dhuillín na gCoimisinéirí Ioncaim a phléann cánachas agus iomarcaíocht anseo

source: In the first instance it is up to the employer to pay the statutory redundancy lump sum to all eligible employees
ga: Is faoin bhfostóir atá sé ar an gcéad ásc an íocaíocht cnapshuime iomarcaíochta reachtúil a íoc le gach aon fostaí incháilithe

source: However, where the employer is unable to pay or refuses or fails to pay, the employee can apply for direct payment from the Social Insurance Fund - see 'How to apply' below
ga: Muna bhfuil an fostóir in ann íoc nó má dhiúltaíonn siad íoc, is féidir leis an fostaí iarratas ar íocaíocht ón gCiste an Árachais Sóisialta a dhéanamh - féach 'Conas iarratas a dhéanamh' thíos

source: Where your employment has been terminated due to the insolvency of your employer legislation provides for the payment of certain outstanding entitlements in relation to your pay
ga: Agus deireadh tagtha le do chuid fostaíochta de bharr dócmhainneacht do fhostóra tiocfaidh reachtaíocht i bhfeidhm maidir le teidlíocht amuigh maidir le do phá

source: Under the Insolvency Payments Scheme these may be paid by the Department of Social Protection out of the Social Insurance Fund
ga: De réir Scéime na n-Íocaíochtaí Dócmhainneachta is féidir leis an Roinn Coimirce Sóisialaí iad seo a íoc as Chiste an Árachais Sóisialta

source: There are more details about employers' insolvency legislation in 'Further information' below
ga: Léigh 'Tuilleadh faisnéise' thíos mar gheall ar an reachtaíocht a bhaineann le dócmhainneacht fostóra

source: Since 1 January 2005 the maximum earnings taken into account in the calculation of statutory redundancy lump sum payments are €600 per week (€31,200 per year)
ga: Ó 1 Eanáir 2005 ar aghaidh an t-uasmhéid tuillimh a bheidh le háireamh i gcóir cnapshuimeanna reachtúil iomarcaíochta ná €600 in aghaidh na seachtaine (€31,200 in aghaidh na bliana)

source: On the date of the termination of employment your employer should pay the redundancy lump sum due to you
ga: Ar dháta foirceannadh fostaíochta ní mór do d’fhostóir cnapshuim iomarcaíochta a íoc leat atá dlite duit

source: If your employer has not paid your redundancy lump sum, you should apply to your employer for it using form RP77 (pdf)
ga: Mura bhfuil do chnapshuim iomarcaíochta íoctha ag d’fhostóir, ba chóir duit iarratas ar d'fhostóir a dhéanamh ar fhoirm RP77 (pdf)

source: If your employer still refuses to pay it, you can apply to the Department of Social Protection for direct payment from the Social Insurance Fund
ga: Má dhiúltaíonn d'fhostóir don íocaíocht fós, is féidir leat iarratas a chur isteach chuig an Roinn Coimirce Sóisialaí le haghaidh íocaíochta dírí ón gCiste Árachais Shóisialaigh

source: This must be done online using form RP50* as follows:
ga: Caithfidh tú iarratas ar líne a dhéanamh agus foirm RP50* á húsáid mar a leanas:

source: • If your employer is unable to pay your redundancy lump sum, they should sign the RP50.They should also submit a letter from an accountant or solicitor stating they are unable to pay and accepting liability for 100% of the lump sum owing to the Social Insurance Fund
ga: Ba chóir dó litir ó chuntasóir nó dhlíodóir a chur isteach le rá nach bhfuil sé ábalta íocaíocht a dhéanamh agus go nglacann sé le dliteanas maidir leis an 100% (85% le haghaidh dífhostú i 2012) atá dlite don Chiste Árachais Shóisialaigh

source: Documentary evidence such as audited accounts should also be included
ga: Ba chóir fianaise dhoiciméadach amhail cuntais iniúchta a iniamh freisin

source: • If your employer refuses to pay your redundancy lump sum or if there is a dispute about redundancy you can bring a claim to the Workplace Relations Commission
ga: • Má dhiúltaíonn d’fhostóir do chnapshuim iomarcaíochta a íoc nó má bhíonn conspóid ann maidir le hiomarcaíocht is féidir leat éileamh a dhéanamh ar an gCoimisiún um Chaidreamh san Áit Oibre

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: This must be done within one year of your dismissal
ga: Caithfear seo a dhéanamh laistigh de bhliain amháin ó do dhífhostú

source: To apply for your lump sum you should complete and sign form RP50
ga: Chun iarratas ar do chnapshuim a dhéanamh, ba chóir duit an fhoirm RP50 a chomhlánú agus a shíniú

source: Send your RP50 form together with a favourable decision from the adjudicator of the Workplace Relations Commission
ga: Cuir an fhoirm RP50 isteach agus cinneadh fabhrach ó breithneoir an Choimisiúin um Chaidreamh san Áit Oibre ag gabháil léi

source: Insolvency: If the company has been liquidated or is in receivership, the completed form RP50,which has been signed by the employee, should be sent in by the liquidator or receiver on behalf of the employees
ga: Dócmhainneacht: Má tá an comhlacht leachtaithe nó curtha faoi ghlacadóireacht, ba chóir don leachtaitheoir nó glacadóir ar son fhostaithe an fhoirm RP50 comhlánaithe, atá sínithe ag an bhfostaí, a chur isteach

source: *As the RP50 form is a legal document it must be signed by the employee even though they have not yet received the redundancy payment
ga: Mar is doiciméad dlíthiúil é an fhoirm RP50, ní mór don fhostaí í a shíniú, cé nach bhfaighidh siad an íocaíocht iomarcaíochta

source: The Department is aware that the employee has not received their payment
ga: Tá a fhios ag an Roinn nach bhfuil an íocaíocht iomarcaíochta faighte ag an bhfostaí

source: If they wish, the employee may insert zeros in the form instead of the amount they are due
ga: Más mian leo, is féidir leis an bhfostaí nialas in áit an méid dlite a chur isteach

source: You can read a list of frequently asked questions about redundancy
ga: Tá liosta ceisteanna coitianta maidir le hiomarcaíocht le fáil

source: For further information about the Redundancy Payments Scheme contact the Workplace Relations Commission's Information and Customer Services
ga: Chun tuilleadh faisnéise faoin Scéim Íocaíochtaí Iomarcaíochta a fháil, déan teagmháil leis an tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre

source: For information on the status of a claim for a redundancy lump sum or rebate which has been submitted for payment you can contact the Redundancy Payments section directly - see 'Where to apply below'
ga: Chun faisnéis faoin stádas éilimh cnapsuim iomarcaíochta a cuireadh isteach, is féidir dul i dteagmháil leis an rannóg Íocaíochtaí Iomarcaíochta go díreach – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: The application for payment from the Social Insurance Fund should be sent to:
ga: Ba chóir duit an t-iarratas ar íocaíocht ón gCiste Árachais Shóisialaigh a sheoladh chuig:

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: Floor 2, Block C
ga: Urlár 2, Bloc C

source: For further information about the Redundancy Payments Scheme contact:
ga: Le tuilleadh faisnéise a fháil maidir leis an Scéim um Íocaíochtaí Iomarcaíochta téigh i dteagmháil leis na:

source: Information and Customer Service
ga: Seirbhíse Faisnéise agus Custaiméara

source: Opening Hours: Mon. to Fri. 9.30am to 5pm
ga: Uaireanta Oscailte:Luan go hAoine 9.30rn go 5in

source: Tel: (059) 917 8990
ga: Teil: (059) 917 8990

source: Locall: 1890 80 80 90
ga: Lóghlao: 1890 80 80 90

source: The Protection of Employees (Employers' Insolvency) Acts 1984–2012 protect certain outstanding entitlements relating to the pay of employees in the event of their employers becoming insolvent as defined in the Acts
ga: Cosnaíonn na hAchtanna um Chosaint Fostaithe (Dócmhainneacht Fostóirí) 1984–2012 teidlíochtaí áirithe gan íoc maidir le pá fostaithe má éiríonn a bhfostóirí dócmhainneach de réir mar a shainmhínítear sna hAchtanna

source: Subject to certain limits and conditions (including statutory time limits), money due to employees in a range of situations may be paid by the Department of Social Protection out of the Social Insurance Fund
ga: Faoi réir theorainneacha agus choinníollacha áirithe (na teorainneacha ama reachtúla san áireamh), féadann an Roinn Coimirce Sóisialaí airgead atá dlite le fostaithe i raon cásanna a íoc as an gCiste Árachais Shóisialaigh

source: Instances where the Department may pay from this fund include circumstances where money due as a result of:
ga: San áireamh ar na cásanna inar féidir leis an Roinn íoc as an gciste seo tá cúinsí ina bhfuil airgead dlite mar thoradh ar:

source: • Arrears of pay (including arrears of pay due under an Employment Regulation Order)
ga: • Riaráistí pá (lena n-áirítear riaráistí pá atá dlite faoi Ordú Rialaithe Fostaíochta)

source: • Holiday and sick pay
ga: • Pá saoire agus breoiteachta

source: • Entitlements under the minimum notice and terms of employment, employment equality and unfair dismissals legislation
ga: • Teidlíochtaí faoin reachtaíocht maidir le fógra íostréimhse agus téarmaí fostaíochta, comhionannas fostaíochta agus dífhostú éagórach

source: • Court orders in respect of wages, holiday pay or damages at common law for wrongful dismissal
ga: • Orduithe cúirte maidir le tuarastal, pá saoire nó damáistí faoin dlí coiteann de bharr dhífhostú éagórach

source: The Insolvency Payments Scheme also protects employees' outstanding contributions to occupational pension schemes which an employer may have deducted from wages but not paid into the schemes
ga: Cosnaíonn Scéim na nÍocaíochtaí Dócmhainneachta ranníocaíochtaí amuigh na bhfostaithe le scéimeanna pinsean gairme a d’fhéadfadh a bheith bainte ó na tuarastail ag an bhfostóir ach nár íocadh isteach sna scéimeanna iad

source: Unpaid contributions to an occupational pension scheme on an employer's own account may also be paid from the Fund, subject to certain limits
ga: Is féidir ranníocaíochtaí nach bhfuil íoctha le scéim pinsean gairme ar chuntas an fhostóra féin a íoc ón gCiste chomh maith, faoi réir theorainneacha áirithe

source: The Scheme applies to outstanding pension contributions for up to a year prior to the date of insolvency
ga: Baineann an Scéim le ranníocaíochtaí pinsean gan íoc suas le bliain roimh dháta na dócmhainneachta

source: The Scheme covers employees who are over 16 years of age and are in employment which is insurable for all benefits under the Social Welfare Acts and includes those over 66 years of age who are in employment which, but for their age, would be insurable for all benefits under the Social Welfare Acts
ga: Clúdaíonn an Scéim fostaithe atá os cionn 16 bliana d’aois agus atá i bhfostaíocht atá inárachais do na sochair uile faoi na hAchtanna Leasa Shóisialaigh agus cuimsíonn sé daoine os cionn 66 bliana d’aois atá i bhfostaíocht a bheadh, mura mbeadh siad an aois sin, inárachais do na sochair uile faoi na hAchtanna Leasa Shóisialaigh

source: Employees should claim from the employer representative (usually the liquidator or receiver) for payment of outstanding entitlements
ga: Ba chóir d’fhostaithe íocaíocht na dteidlíochtaí gan íoc a éileamh ó ionadaí an fhostóra (an leachtaitheoir nó glacadóir de ghnáth)

source: The employer representative can claim an insolvency payment online
ga: Is féidir l'ionadaí an fhostóra iarratas dócmhainneachta ar líne a dhéanamh

source: Disputes regarding most entitlements under the Acts may be referred to the Workplace Relations Commission
ga: Is féidir díospóidí maidir leis an gcuid is mó de na teidlíochtaí faoi na hAchtanna a tharchur chuig an gCoimisiún um Chaidreamh san Áit Oibre

source: There is further information in the Employee Guide to the Insolvency Payments Scheme
ga: Le tuilleadh faisnéise a fháil féach Treoir do Fhostaí maidir le Scéim na nÍocaíochtaí Dócmhainneachta

source: Implementation of Directive 2002/74/EC
ga: Forfheidhmiú na Treorach 2002/74/CE

source: The European Communities (Protection of Employees (Employers' Insolvency) Regulations SI 630/2005 amend the Protection of Employees (Employers' Insolvency) Act 1984 by including a provision to cover employees who are employed by an employer who has become insolvent under the laws, regulations and administrative procedures of another member state
ga: Leasaíonn Rialacháin na gComhphobal Eorpach (Cosaint Fostaithe (Dócmhainneacht Fostóirí) IR 630/2005 an tAcht um Chosaint Fostaithe (Dócmhainneacht Fostóirí) 1984 trí fhoráil a chuimsiú chun fostaithe a chlúdach atá fostaithe ag fostóir atá tar éis éirí dócmhainneach faoi dhlíthe, rialacháin agus nósanna imeachta riaracháin Ballstáit eile

source: The Regulations apply to insolvencies occurring from 8 October 2005
ga: Baineann na Rialacháin le dócmhainneacht a tharlaíonn ó 8 Deireadh Fómhair 2005 ar aghaidh
